In [1]:
import pandas as pd
import numpy as np
import statistics as st 

# Load the data
df = pd.read_csv("loan_data.csv")
print(df.shape)
print(df.info())

(614, 13)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB
None

In [2]:
df.mean()

C:\Users\HP\AppData\Local\Temp\ipykernel_14380\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

ApplicantIncome      5403.459283
CoapplicantIncome    1621.245798
LoanAmount            146.412162
Loan_Amount_Term      342.000000
Credit_History          0.842199
dtype: float64

In [4]:

print(df.loc[:,'ApplicantIncome'].mean())

5403.459283387622

In [5]:
df.mean(axis = 1)[0:10]

C:\Users\HP\AppData\Local\Temp\ipykernel_14380\1983962910.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis = 1)[0:10]

0    1552.5
1    1316.0
2     685.4
3    1084.4
4    1300.4
5    2048.2
6     861.0
7    1211.6
8    1212.2
9    4903.8
dtype: float64

In [6]:
df.median(axis=1)

C:\Users\HP\AppData\Local\Temp\ipykernel_14380\3214761434.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median(axis=1)

0      180.5
1      360.0
2       66.0
3      360.0
4      141.0
       ...
609     71.0
610     40.0
611    253.0
612    187.0
613    133.0
Length: 614, dtype: float64

In [7]:
df.median()

C:\Users\HP\AppData\Local\Temp\ipykernel_14380\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

ApplicantIncome      3812.5
CoapplicantIncome    1188.5
LoanAmount            128.0
Loan_Amount_Term      360.0
Credit_History          1.0
dtype: float64

In [8]:

print(df.loc[:,'ApplicantIncome'].median())

df.median(axis = 1)[0:10]

3812.5

C:\Users\HP\AppData\Local\Temp\ipykernel_14380\1841509892.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median(axis = 1)[0:10]

0    180.5
1    360.0
2     66.0
3    360.0
4    141.0
5    360.0
6    360.0
7    360.0
8    360.0
9    360.0
dtype: float64

In [9]:
df.mode()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,Yes,0,Graduate,No,2500.0,0.0,120.0,360.0,1.0,Semiurban,Y
1,LP001003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,LP001005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,LP001006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,LP001008,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
610,LP002979,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
611,LP002983,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
612,LP002984,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
613,LP002990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
#Measure the Standard deviation
df.std()

C:\Users\HP\AppData\Local\Temp\ipykernel_14380\1952243819.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

ApplicantIncome      6109.041673
CoapplicantIncome    2926.248369
LoanAmount             85.587325
Loan_Amount_Term       65.120410
Credit_History          0.364878
dtype: float64

In [12]:

print(df.loc[:,'ApplicantIncome'].std())

#calculate the standard deviation of the first five rows 
df.std(axis = 1)[0:10]

6109.041673387174

C:\Users\HP\AppData\Local\Temp\ipykernel_14380\534997705.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std(axis = 1)[0:10]

0    2869.342375
1    1921.240355
2    1302.410381
3    1274.405469
4    2631.267812
5    2558.103731
6    1021.416419
7    1440.659849
8    1672.378008
9    6426.574414
dtype: float64

In [13]:
#easure the Variance
df.var()

C:\Users\HP\AppData\Local\Temp\ipykernel_14380\3120059384.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

ApplicantIncome      3.732039e+07
CoapplicantIncome    8.562930e+06
LoanAmount           7.325190e+03
Loan_Amount_Term     4.240668e+03
Credit_History       1.331362e-01
dtype: float64

In [14]:
#Measures the Interquartile Range (IQR)
from scipy.stats import iqr
iqr(df['ApplicantIncome'])

2917.5

In [16]:
print(df.skew())
#The skewness values can be interpreted in the following manner:

#Highly skewed distribution: If the skewness value is less than −1 or greater than +1.

#Moderately skewed distribution: If the skewness value is between −1 and −½ or between +½ and +1.

#Approximately symmetric distribution: If the skewness value is between −½ and +½.'''

ApplicantIncome      6.539513
CoapplicantIncome    7.491531
LoanAmount           2.677552
Loan_Amount_Term    -2.362414
Credit_History      -1.882361
dtype: float64

C:\Users\HP\AppData\Local\Temp\ipykernel_14380\2184635283.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.skew())

'#The skewness values can be interpreted in the following manner:\n\n#Highly skewed distribution: If the skewness value is less than −1 or greater than +1.\n\n#Moderately skewed distribution: If the skewness value is between −1 and −½ or between +½ and +1.\n\n#Approximately symmetric distribution: If the skewness value is between −½ and +½.'

In [17]:
df.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [18]:
df.describe(include='all')

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
count,614,601,611,599,614,582,614.000000,614.000000,592.000000,600.00000,564.000000,614,614
unique,614,2,2,4,2,2,NaN,NaN,NaN,NaN,NaN,3,2
top,LP001002,Male,Yes,0,Graduate,No,NaN,NaN,NaN,NaN,NaN,Semiurban,Y
freq,1,489,398,345,480,500,NaN,NaN,NaN,NaN,NaN,233,422
mean,NaN,NaN,NaN,NaN,NaN,NaN,5403.459283,1621.245798,146.412162,342.00000,0.842199,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,6109.041673,2926.248369,85.587325,65.12041,0.364878,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,150.000000,0.000000,9.000000,12.00000,0.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,2877.500000,0.000000,100.000000,360.00000,1.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,3812.500000,1188.500000,128.000000,360.00000,1.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,5795.000000,2297.250000,168.000000,360.00000,1.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,81000.000000,41667.000000,700.000000,480.00000,1.000000,NaN,NaN

In [19]:
df.groupby('Gender')['ApplicantIncome']

In [20]:
df.groupby('Gender')['ApplicantIncome'].sum()

Gender
Female     520069
Male      2663319
Name: ApplicantIncome, dtype: int64

In [21]:
data = {'Gender':['m','f','f','m','f','m','m']}
df_sample = pd.DataFrame(data)
df_sample

  Gender
0      m
1      f
2      f
3      m
4      f
5      m
6      m

In [22]:
f_filter = df_sample['Gender']=='f'
print(df_sample[f_filter])

m_filter = df_sample['Gender']=='m'
print(df_sample[m_filter])

  Gender
1      f
2      f
4      f
  Gender
0      m
3      m
5      m
6      m